---
type: WorksetFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# WorksetFilter

`Autodesk.Revit.DB.WorksetFilter` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IncludeStandaloneWorksetsOnly | 2012 | `public bool IncludeStandaloneWorksetsOnly { get ; set ; }` |
| Property | Inverted | 2012 | `public bool Inverted { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |